#include "delay.h"

#include "intrins.h"

vuint16 zf_delay_ms = 0;
vuint16 zf_delay_us = 0;

//-------------------------------------------------------------------------------------------------------------------
//  @brief      软件延时函数初始化
//  @param      NULL         
//  @return     void
//  Sample usage:               无需用户调用，用户请使用h文件中的宏定义
//-------------------------------------------------------------------------------------------------------------------
void delay_init(void)
{
	zf_delay_ms = 45158400/ 15000;
	zf_delay_us = 45158400 / 17500000;
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      软件延时函数(这是一个不准确的延时)
//  @param      x            	需要延时的时间（ms）
//  @return     void
//  Sample usage:               无需用户调用，用户请使用h文件中的宏定义
//-------------------------------------------------------------------------------------------------------------------
void delay_ms(uint16 ms)
{
	vuint16 i;
	do {
			i = zf_delay_ms;
			while(--i);
	   }while(--ms);
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      软件延时函数(这是一个不准确的延时)
//  @param      x            	需要延时的时间（us）
//  @return     void
//  Sample usage:               无需用户调用，用户请使用h文件中的宏定义
//-------------------------------------------------------------------------------------------------------------------
void delay_us(uint32 us)
{
	uint16 i;
	do {
			i = zf_delay_us;
			while(--i);
	   }while(--us);
}
